chapters/01-summer-vacation.org
#+OPTIONS: H:4
#+AUTHOR: nekosensei
#+TITLE: Revolutionary Ballerina Lyrical Ahiru
#+OPTIONS: html-postamble:nil
#+OPTIONS: date:nil creator:nil
#+OPTIONS: num:nil
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [koma,b5paper,oneside,notitle]
#+LATEX_HEADER: \usepackage{indentfirst}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage[adobe-utopia]{mathdesign}
#+LATEX_HEADER: \usepackage[scaled]{berasans}
#+LATEX_HEADER: \usepackage[scaled]{beramono}
#+LATEX_HEADER: \setlength{\parskip}{1mm}

