html/01-summer-vacation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Revolutionary Ballerina Lyrical Ahiru</title>
<!-- 2017-06-11 Sun 23:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="nekosensei" />
</head>
<body>
<div id="content">
<h1 class="title">Revolutionary Ballerina Lyrical Ahiru</h1>
