html/01-summer-vacation.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Episode One</a>
<ul>
<li><a href="#sec-1-1">Commercial Break</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Episode One</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>stamp</b> <b>stamp</b> <b>stamp</b>
<b>stamp</b> <b>stamp</b>
</p>

<p>
"<i>Feliz cumpleanos</i>," said the border agent to Laura, as he returned
all the passports in a pile and handed them to Dad, who set about
collating the immigration cards and sorting them among the family.
</p>

<p>
"Ophelia Biliski, citizen&#x2026; of the <i>world</i>."
</p>

<p>
Ophelia (age: 12 - citizenship - United States - place of birth -
Pennsylvania) twirled around <i>twice</i> and held the little blue passport
(issuing authority - US Department of State) high in the air.
</p>

<p>
"Citizen of <i>crazy-town</i> is more like it," observed her brother Randy.
</p>

<p>
"Please, please," said Laura. "She said citizen of the world. Isn't
that just redundant?"
</p>

<p>
"&#x2026; Point."
</p>

<hr  />

<p>
"I can't find my <a href="https://www.youtube.com/watch?v=P-bz4kRtCQI">Scott Hahn</a> tape,"
observed Mom.
</p>

<p>
"I think I put it in the big luggage."
</p>

<p>
"Oh thank <i>god</i>." said Randy.
</p>

<p>
"We'll sort through it later," said Dad.
</p>

<p>
"Hey. I don't mind the Scott Hahn talks," said Ophelia.
</p>

<p>
"Well aren't you a little miss goody two-shoes," said Randy."
</p>

<p>
"Hey. HEY. It's just not right to call your sister names like that."
said Laura.
</p>

<p>
"Are you kidding? She's like the most -"
</p>

<p>
"No, I mean, <i>miss goody two-shoes</i> is structurally wrong. It's two
forms of address. Either she's <a href="https://www.youtube.com/watch?v=P-bz4kRtCQI">Goodwife Two-Shoes</a>, or Mistress
Two-Shoes, but both at once is just <i>incorrect</i>."
</p>

<p>
"It's redundant." noted Ophelia.
</p>

<p>
"&#x2026; As you wish, Princess Two-Shoes."
</p>

<p>
"I've got some stuff we could listen to on my phone," offered Laura.
</p>

<p>
"&#x2026; I don't think your mother really cares for most of your music."
noted Dad.
</p>

<p>
"Mmf." mumbled Mom, leaning against a window, trying not to be carsick.
</p>

<p>
"I have, somwhere&#x2026;" said Rose, fiddling with the device, "&#x2026; aha!
Here we go. Vintage radio drama."
</p>

<p>
"Blagh." opined Randy.
</p>

<p>
"Vintage radio <i>crime</i> drama."
</p>

<p>
"You have my attention!" recanted the boy.
</p>

<p>
"Who knows what evil lurks in the hearts of man? Heh heh heh heh
heh&#x2026; <a href="https://www.youtube.com/watch?v=q061NWVbj-Q">the Shadow knows!</a>" intoned the car radio.
</p>


<hr  />

<p>
They'd run out of vintage radio crime drama, and were bouncing along
the highway singing a capella.
</p>

<p>
"Boys may come, and boys may go, and that's all right, you see," wailed
Laura, channeling <a href="https://youtu.be/e3wYIjI8WcI?t=185">Madonna</a>.
</p>

<p>
"liv. ing. in a mat erial world," chanted Randy in his most
 robotic impersonation of a backup singer.
</p>

<p>
"Great," complained Mom, still feeling a bit carsick. "We haul you all
the way to Mexico so you can sing the worst of American pop."
</p>

<p>
"Would you prefer &#x2026; mariachi?" inquired Randy, flatly.
</p>

<p>
"<i>Yo no puedo mariachi. No hablamos tan mas de Espanol</i>", objected
Ophelia.
</p>

<p>
"Yeah, yo no hablaminos&#x2026; Foreign languages are hard," said
Randy. "Music is even harder."
</p>

<p>
"Actually, I think the songs make it easier to learn."
</p>

<p>
"Sure, I guess," said Randy, "if you mean like <a href="https://www.youtube.com/watch?v=s6qRMHpV7Pc">Pescador de Hombres</a> or
something that Mom always plays."
</p>

<p>
"We should watch more shows together," proposed Ophelia. "Television
is also a great way to learn, especially with captions."
</p>

<p>
"What television do you &#x2026; wait. Wait, NO!"
</p>

<p>
Ophelia beamed. "You can pick up all sorts of useful Japanese phrases
watching magical girl shows."
</p>

<p>
"Me think <i>snot</i>," said Randy.
</p>

<p>
"I want to take Japanese once I get to high school so I can do a
semester abroad in college."
</p>

<p>
"OooOoh, somebody's got <i>life plans</i>. Good for youuu," said the little
brother.
</p>

<p>
"I am thoroughly in agreement with these life plans," said Laura, "and
magical girl shows supply so many ever-so-useful phrases.
'<i>Sayonara, Homura-chan! Genki de ne!</i>'"
She placed her hand over her heart, passionately.
</p>

<p>
"&#x2026; That's&#x2026; I don't think I've seen that show." noted Ophelia.
</p>

<p>
"Well, you NEED to!" said Laura. "It's basically the bestest."
</p>

<p>
"No, you two are the bestest! <a href="https://www.youtube.com/watch?v=uDgx8r4cbeU">Dai dai daisuki!</a>" smiled Ophelia,
hugging them both, one on either side. She leaned her head over to
nuzzle her cheek up against Randy's.
</p>

<p>
"Mom! Dad! She's smiling on me! Make her stop."
</p>

<p>
Dad cleared his throat. "<a href="https://youtu.be/tsxVGb2d9dw?t=98">Come on, people now.</a>"
</p>

<p>
"Aaaaaaaarrrrrrrrggggggggggggghhhhhhh!"
</p>

<p>
"Okay, here's one you might appreciate right now,"
offered Laura. '<a href="https://www.youtube.com/watch?v=R229aaDg3Gk">Urusai, urusai, urusai!</a>'"
</p>

<p>
"Here's one for you: <i>Bwaaaaaaaarrrrrrrrrrrrgh</i>."
</p>

<p>
"Uh huh. And who is that quoting?" enquired Laura.
</p>

<p>
"Duh. Godzilla."
</p>

<hr  />

<p>
"We should just stop at one of those guys selling street food," said
Randy, "and eat in the car."
</p>

<p>
"Not in a rental car, thank you," said Dad. "I'm not paying a hundred
dollars cleaning fee."
</p>

<p>
"Well then, we can stand outside in the shade somewhere."
</p>

<p>
"Randy. You know what Mom would say. <a href="https://youtu.be/lC2u_24kdCg?t=42">You don't have to eat like a
refugee</a>." observed Ophelia.
</p>

<p>
"<i>This one!</i>" said Mom. "Stop here! It's got a Virgin of Guadalupe in
front. Ha ha!"
</p>

<p>
"Mom," noted Laura, "this&#x2026; is Mexico. That&#x2026; is a tacqueria. They
<i>all</i> have the Virgin of Guadalupe somewhere."
</p>

<p>
"Yeah, well, this one has it in front, and I saw it! We're stopping
here. We're stopping here!!" sang Mom.
</p>

<p>
Dad parked the car.
</p>

<p>
"Ah, <i>Mexico</i>," said Randy. He said it in a stylized way, "May-hi-co",
a self-aware gringo's rendition of the accent.
</p>

<p>
"Ah, Mom." said Ophelia.
</p>

<p>
"Ophelia," said Laura. "<i>Mi madre&#x2026; es su madre.</i>"
</p>

<p>
"Uuuuuuurrrgh," said Randy, failing to surpress his
laugh. "No. No. Whyyyyy?"
</p>

<p>
Inside, Mom considered the menu.
</p>

<p>
"So what's everyone getting?" asked Dad.
</p>

<p>
"I have an idea," offered Randy. "<i>Mexican.</i>"
</p>

<p>
"Churros?" inquired Ophelia.
</p>

<p>
"Tacos," said Mom.
</p>

<p>
"Burritos," suggested Laura.
</p>

<p>
"You know that -ito is just&#x2026; what do you call it&#x2026; a diminutive,
right?" asked Randy.
</p>

<p>
"Si si, Randito," said Ophelia.
</p>

<p>
"Never mind <i>Randito</i>. The food."
</p>

<p>
"What about the food?"
</p>

<p>
"Burritos. Burros. You're going to eat <i>little donkeys</i>."
</p>

<p>
"Hey, I like donkeys," said Mom. "They're gentle creatures."
</p>

<p>
"Ah, Mom." said Ophelia.
</p>

<p>
"Oh, hey," said Laura. "We could get <i>tequila shots</i>."
</p>

<p>
"We are not getting tequila shots," said Mom.
</p>

<p>
"Actually, maybe you should. She might swear off alcohol for life,"
proposed Dad.
</p>

<hr  />

<p>
"Are we there yet?" asked Randy, as they got into the car.
</p>

<p>
"Another hour and a bit," said Dad.
</p>

<p>
"Don't worry!" said Mom, holding aloft a CD. "I haven't found Scott
Hahn but I <i>have</i> found some music!"
</p>

<p>
"What? &#x2026; Wait - nooooooooooo!" cried Randy.
</p>

<p>
"Hey. I don't mind Mom's music." said Ophelia.
</p>

<p>
"Well, good for you," snapped Randy.
</p>

<p>
"Randy," cautioned Dad, "I'll thank you to show a little respect to
your sister, <i>and</i> your mother." He placed the CD in the car.
</p>

<p>
"It's <i>objectively terrible.</i> It's like&#x2026; three-chord rock and roll,
but without any of the rock, or the roll."
</p>

<p>
"Actually," offered Ophelia, "there's a really nice circle of fifths
in the third &#x2013;"
</p>

<p>
"I don't caaaaaaaaaare." said Randy.
</p>

<p>
"Good. You don't care. When the fire falls from the heavens on
Judgement Day you can tell Saint Michael, in detail, all about how you
don't care." said Mom.
</p>

<p>
"Randolph," said Dad, turning off the car.
</p>

<p>
"What?"
</p>

<p>
"See over there by the overpass?"
</p>

<p>
"What, the bus stop?"
</p>

<p>
"If you'd rather not ride with us, you can take a <i>collectivo</i>. Tell
the driver you want Cenote Pacifico." He started to take out his
wallet. "Will you pass me the phrase-book, dear?"
</p>

<p>
It was very quiet, for more than a moment.
</p>

<p>
"That's what I thought," said Dad, starting the car again.
</p>

<p>
Mom played her CD.
</p>

<p>
No one said much of anything for a few minutes.
</p>

<p>
"<a href="https://youtu.be/D4hXJ9ax2FY?t=36">Send forth your word</a>", said the CD, "Lord, and let there be light!"
</p>

<p>
<i>braaaaaaaaaaaaaaap</i>, went a noise.
</p>

<p>
"<i>Randy</i>." said Dad.
</p>

<p>
"I'm sorry, Dad, that was me." interjected Ophelia.
</p>

<p>
"Wooh, ugh." said Mom. "Beans!"
</p>

<p>
Ophelia looked embarrassed.
</p>

<p>
"No one <i>ever</i> suspects Goodwife Two-Shoes," said Laura.
</p>

<p>
"Pull over, I think I'm going to be sick." said Mom.
</p>

<p>
Dad pulled over, and rolled down the windows.
</p>

<p>
Mom sat a while. The <i>song</i> part of the praise and worship tape faded
into a sort of a prayerful coda. "Let mercy triumph over judgment,"
said the voice on the CD.
</p>

<hr  />

<p>
"This is the place?" asked Ophelia.
</p>

<p>
"Sweatness!" exclaimed Laura.
</p>

<p>
"&#x2026; sweatness?" asked Mom.
</p>

<p>
"Yeah. It's like saying <i>sweetness</i>, but &#x2026; hotter."
</p>

<p>
"Thank you for that&#x2026; <i>vivid</i> interjection," said Randy, still a
little subdued.
</p>

<p>
"Anytime, bro."
</p>

<p>
Randy looked around. "I don't see the beach," he noted flatly.
</p>

<p>
"We don't have a place on the beach." said Dad. "We have the nicest
place that's willing to give us a free stay while trying to convince
us to buy a timeshare."
</p>

<p>
"Watch the car for a moment," said Mom to Laura, "I'm going in to
powder my nose."
</p>

<p>
A moment passed to the 'tink. tink. tink.' sounds of a cooling engine
block.
</p>

<p>
"Thanks for, uh, covering for me," said Randy to Ophelia.
</p>

<p>
"<i>Randito mio</i>&#x2026; it's like they say. <i>Mi madre es su madre.</i>" offered
Ophelia.
</p>

<p>
"Yeah. It's true." said Randy. "It's true."
</p>

<hr  />

<p>
"Cooooool." Randy gazed over the edge of a railing into the rather
large, elegantly furnished hole in the ground.
</p>

<p>
"Aquí es &#x2026; Cenote Pacifico," said Laura.
</p>

<p>
"It <i>is</i> cool. It's connected to underground caves!" said Ophelia.
</p>

<p>
"Mmm. Natural air conditioning. I like." opined Randy.
</p>

<p>
"And it's got <i>shade</i>, so I can swim around, without turning into a
lobster!"
</p>

<p>
"Yeah, well, it's not my fault you're so&#x2026;"
</p>

<p>
"White?"
</p>

<p>
"I was gonna say <i>Slavic</i>," said Randy.
</p>

<p>
"Ah. Mom's fault."
</p>

<p>
"Mmm, yes, Parental Unit Number 2."
</p>

<p>
"Parental unit &#x2026; nevermind." said Laura.
</p>

<p>
Mom was a few steps behind coming out of the lobby. "Okay, here we
go. I brought one for everybody."
</p>

<p>
"Brought one what?" asked Randy, as mom handed him a small bottle.
"&#x2026;. Holy water?"
</p>

<p>
"The cenote is supposed to be a portal to the <i>underworld.</i> I'm not
letting any of my children play around in a portal to the underworld
unless you bless yourself <i>first</i>. Basic parenting."
</p>

<p>
"Oh god she's serious", mumbled Randy.
</p>

<p>
"Uhh&#x2026;" said Laura&#x2026;
</p>

<p>
"Every time you go in," said Mom.
</p>

<p>
"Okay, I promise." said Ophelia, extracting a few drops. "I'll do it
right now."
</p>

<p>
"Mmmm. Exactly as one would expect from Princess Two-Shoes", noted
Randy.
</p>

<p>
"It won't hurt you," noted Ophelia.
</p>

<p>
"<a href="https://www.youtube.com/watch?v=ap_mEm8m0HU">It burnssssss us!</a>" emoted Randy.
</p>


<p>
"Please, Smeagol. You've been with us how many years? If holy water
<i>actually</i> hurt you in <i>any</i> way, you'd have died a long, long time
ago," said Ophelia.
</p>

<p>
"Maybe I <i>am</i> dead, and this is all just my trip to the underworld,"
suggested Randy, pointing to the cenote.
</p>

<p>
"Hmmbly," pondered Laura. "That's as good an explanation as any."
</p>

<p>
"Hey, Parental Unit 1," asked Randy, "can we go to Chicken Itza?"
</p>

<p>
"Chicken?" inquired Ophelia.
</p>

<p>
"We are not going to Chichen Itza," declared Mom.
</p>

<p>
"We're not? Would you deny our children the sight of one of the
Wonders of the World?" asked Dad, as he unlocked the room.
</p>

<p>
"Yes," declared Mom, without a moment's hesitation. "We're not here
for cultural exchange with a civilization of bloodthirsty pagans,
we're here to <i>relax</i>. Besides which, it's a four hour drive, and
I don't feel like being carsick the whole way."
</p>

<p>
"Bloodthirsty pagans," said Laura, rolling her eyes. "Gee. Tell us how
you <i>really</i> feel."
</p>

<p>
"You know, it won't hurt you children to start caring about your own
souls for once," said Mom. "That goes double for you, little miss I'm
Eighteen Now."
</p>

<p>
"Okay, enough," interrupted Dad, loudly. "How about we figure out
rooms and relax for a bit? I'm sure we're all tired and a little
cranky."
</p>

<hr  />

<p>
"It's still not fair that I have to sleep on the couch," complained
Randy.
</p>

<p>
"Yeah, well, you get your own room at home, you can deal with a little
inconvenience now and then," retorted Laura.
</p>

<p>
"Actually, I'm going to miss sharing with you," said Ophelia to her
sister.
</p>

<p>
"Awwwwwww," said Laura, smiling on Ophelia. "That's just 'cuz you're
so sweet."
</p>

<p>
"'Beautiful cinnamon roll too good for this world, too pure,'"
quoted Randy.
</p>

<p>
"'Look at this angelic confection!'" said Laura.
</p>

<p>
"I think you have me confused with an Onion," objected Ophelia.
</p>

<p>
"Hey Laura. When you're done smiling on your sister," said Mom, "we
can order birthday drinks."
</p>

<p>
"OooooOooOoooh," said Laura.
</p>

<p>
"Are you sure that's a good idea?" asked Dad.
</p>

<p>
"My plan is to spoil her rotten with the <i>good</i> stuff so she'll be too
much of a liquor snob to drink anything at big campus parties," said
Mom.
</p>

<p>
"This is a silly plan," noted Laura. "I think I approve."
</p>

<p>
Dad rolled his eyes. "I think I'd best leave you <i>girls</i> to girl
stuff."
</p>

<p>
"Same," sighed Randy. "Enjoy the corn squeezin's for me."
</p>

<p>
"But Randito, <i>you're</i> the corniest one around," noted Laura, reaching
out for a hug.
</p>

<hr  />

<p>
The waiter visited the table. "Another drink for you, señorita?"
</p>

<p>
"You're sure you haven't had too much?" asked Ophelia.
</p>

<p>
"We're not as think as you drunk we am," retorted Laura.
</p>

<p>
"I told you this would be better than tequila shots," said Mom.
</p>

<p>
Laura pointed to a spot on the drink menu. "How about this one?"
</p>

<p>
"I think I'll leave you guys to your booze," said Dad.
</p>

<p>
"Glorious," remarked Randy. "I'll come with."
</p>

<p>
"You all are no fun," said Laura.
</p>

<p>
The waiter left with the order.
</p>

<p>
"What did you get?" asked Mom, looking at the menu. "Wait&#x2026; cinnamon?
In a cocktail??"
</p>

<hr  />

<p>
"Blegh!" said Laura. She put down the cocktail glass.
</p>

<p>
"Told you so," said Mom.
</p>

<p>
"I <i>like</i> cimmanum," said Ophelia, "but it's not really authentic and
Mexican. Now, really bitter chocolate, sure&#x2026;"
</p>

<p>
"Never mind that," said Laura, dismissively. "I think I'm feeling
kinda&#x2026; queasy."
</p>

<p>
"Are you all right?" asked Mom.
</p>

<p>
"Mmmaybe a little wobbly," said Laura. "Donde están un baños?"
</p>

<p>
"<i>Los baños</i>," corrected Ophelia. "It's in California, about halfway
up."
</p>

<p>
"You know what I mean," snapped Laura.
</p>

<p>
"Right," said Mom. "Ophelia, can you watch the stuff a moment? Your
sister may be thinker than she thought she was."
</p>

<p>
"Okay, Mom," replied Ophelia, as the pair disappeared.
</p>

<p>
Ophelia waited quietly for a moment, pondering. This corner of the dining
area was pretty empty, wasn't it? She looked for the waiter. He was
busy on the other side of the restaurant.
</p>

<p>
She looked to the left.
</p>

<p>
She looked to the right.
</p>

<p>
Then she picked up the cocktail glass, with the care and attention one
might pay to a holy relic.
</p>

<p>
"Nobody <i>ever</i> suspects the goodwife Two-Shoes," declared the girl to
herself, quietly.
</p>

<p>
The waiter had cleared off the table before Mom got back.
</p>
</div>
