chapters/01-summer-vacation.org
** Commercial Break

/Author's note: I am unapologetic about this shift in style./
/The previous section will be edited in due course/
/and will contain additional exposition./
/In the meantime, please have these notes and this section./

/The Yucatan peninsula is made of limestone./
/Sometimes the ground gives way to reveal freshwater/
/pools that had been hidden underneath the surface./
/Some are attached to vast underwater cave systems./
/They were regarded as sacred, portals to the underworld./

Ophelia, barefoot, in naught but a nightgown, carefully opened the
door and looked out at the night.

A few moments later, she carefully closed the door.

Another pause and she carefully opened the door, again, still
barefoot, but with a handbag. This would be important. The room key
was in the handbag, and there would be no tiptoeing past her brother
on the couch to get back in if she locked herself out.

In fact, the Goodwife No-Shoes was presently regretting her little
adventure. The cinnamony cocktail had been quite large, and she was
herself fairly small, and her stomach felt queasy. And the air in the
room was quite dry, from all the air conditioning. A walk outside in
the fresh air, then, seemed just the thing. Past the nook with the
rattling ice machine, down the stairs, over by the water fountain. A
pause, for a moment, to look at the full moon. The fountain bothered
her, though. The whole time-share bothered her, as a place. It was all
over-produced, trying to project the image of Luxury without bothering
to invest in the luxuries; all veneer and no substance, which was
somehow worse than not even trying.

The cenote was real enough, at least.

She soon found herself at the top of the stairs. The cenote -- more or
less a hole in the ground, with fresh water in the bottom -- wound
their way around the walls to a little platform at the bottom, with
stairs into the water.  The water would be cool and nice. Tempting.
She took a look at the to the stairs, closed - peligro!

Closed, but not locked. Ophelia considered a moment, pondering the
merits of continuing. A thought occurred to her.  She had made a
promise to her mother about going into the water... and her little
bottle of holy water was right there, in her bag.

So she annointed herself with a few drops, made the Sign of the Cross,
and descended, being careful to hold the handrail extra-carefully, and
sat down on the edge of the platform. The water was still, like glass,
reflecting the moon. She poked at the surface of the water with her
toes, experimentally, thinking to send gentle ripples towards the
reflection.

But something unusual happened. The water was cool, as expected, but
its surface was somehow firm; it did not make way for her foot.  For a
moment she was confused: was there perhaps a rock just there under the
water? But no -- further probing showed the whole surface to be like
glass.

With a smile she stepped down onto the water, twirled about a few
times, and laughed. With cautious steps, she made her way across the
pool of water to the reflection of the moon. Then the surface of the
water glowed a pale blue, and the water surged around her like a
fountain, and the underworld took her.

-----

A number of things happened next, but they flowed from one to another
in a dream-like way, so it was hard to put them all in a definite
order. Perhaps they all happened at once. Perhaps none of them
happened at all. It is hard to say.

In one moment, she was standing on a brightly lit stage, performing a
song with her choir at school. She had a solo, and looked out at the
audience, and saw instead a field of stars. In another moment, she was
wandering through the woods behind her house - which bled into a
third, as she continued along a path surrounded by tall weeds, past an
ill-kempt railway station to the little old ballet studio. In another,
it was fall, and she had climbed the dogwood tree in her backyard, and
looked out over a sea of red leaves.

In turn they all gave way to a conversation. It was a dark place, with
stone walls, lit by dim, flaring lamps. On one side was a wide
passageway, leading around a corner, and on the wall was a large
shadow with glowing eyes and a deep, deep voice.

"What in God's name are you doing here?" asked the voice, and Ophelia
caught a glimpse of what might have been pointy teeth.

"Oh," said Ophelia, still just a little disoriented, "I suppose I'm
looking for an adventure."

"An adventure," repeated the shadow, skeptically. "In the underworld."

"It was really just a spur-of-the-moment thing," explained Ophelia,
"a once in a lifetime opportunity. How could I refuse?"

The shadow paused for a moment, perhaps considering. "Be that as it may,
this way was not meant for you. It's not too late to turn back."

"Not meant for me? Why not?" asked Ophelia.

"It just /wasn't/. For starters, your age. You are either too young,
or else far too old."

"Yeah, well, that's basically middle school, isn't it?"

"Hmmph," said the voice, and it was quiet for a while.

"So anyway, what's your name?" asked Ophelia.

"I am... /el zorro/," said the voice.

"Zorro?" said Ophelia. She immediately recalled trips to the library
with her father, renting classic black and white TV series on DVDs:
bandits, and horses, and a vigilante in a mask, ridiculously bad
swordplay... an old theme song straight out of the fifties, three
slashes with a sword.

An insight occurred to the girl, and she was quite pleased with
herself.

"... the /fox/, so cunning and free!"

"Mmm," grunted the shadow.

But Ophelia was not quite content to leave it at that. "It's a pretty
cool name, but it reminds me of hokey old television. Can I call
you Zorrito?"

"/What./"

The voice had lost some of its depth.

"... it's a diminutive?"

The shadow melted away from the wall, and from around the corner
strolled a rather ordinary-sized fox, with sandy fur. "You're in the
/underworld/, talking to a shadow easily twenty times your size, and
you decide to /name it/ with a /diminutive?/" He gave an exasperated
sigh. "Tell me, what would you have done if I had just decided to eat
you right there?"

"Holy water?"

The small fox eyed Ophelia skeptically. "Fine. You're either a born
natural, or you're quite mad. Probably both. Proceed, then, on your
adventure."

"Oh. Did I just pass some sort of a test?"

"No," said the fox, "I'm here to warn off the unqualified, and /maybe/
occasionally even eat them. You're just lucky that I'm tame."

The girl furrowed her brow. "Eating people doesn't really seem very
tame."

"It's a different matter for different people, of course," explained
the fox. "In your case, you can probably thank your mother."

"Huh." She looked at the fox, quizzically.

"Well. Weren't you going on an adventure?"

"I suppose I was!"

"Well, I'm not here to tell you what to do, but it won't be much of an
adventure if you just lurk around in the first antechamber for all
eternity. Even if you're in love with antechambers, I assure you,
we have better ones."

"Right," said Ophelia, and set off down the corridor.

-----

The path led out from behind a waterfall and across a pool as a series
of stepping-stones. The fall itself was tall and narrow, but the flow
was silky and smooth, like a dreamy long-exposure photo of falling
water, and when she passed through, it didn't feel wet, just
effervescent, and her nightgown remained dry.

She was in a narrow valley, and the sky above was lit like the surface
of the water, but with more colors. When the stepping stones ended,
she stepped out onto the water again, and walked across the
surface. Her braid had come undone in the waterfall, and her hair
trailed back behind her as she walked, as if she was underwater.

Zorrito, not far behind, sat down on the surface of the water, and
floated along behind. Soon, they arrived at a great edifice,
stretching across the valley, with grand doors that were probably
taller than her house, all inscribed with a language she didn't
understand.

"It's not very Aztec, is it?" asked Ophelia, taking stock of the place.

"Of course it isn't," said Zorro.

"Why not?"

"You yourself are of mixed Slavic and English heritage, and Christian
upbringing. You are staying in Mexico, yes, but at a cenote long
abandoned by the native population, in a hotel constructed by a
post-colonial, mestizo labor force, on behalf of a Delaware
corporation. But even aside from all this, even we were at Chichen
Itza itself during the heyday of the indigenous peoples of the Yucatan
peninsula, it would not have been Aztec" said the fox, pausing a
moment for special emphasis, "because they were /Mayans./"

"Oh," said Ophelia, abashed. She looked up at the doors, a deep black,
lettering inlaid with silver. The door handles were well above her
head.

She puzzled about that for a bit, to distract herself from her
mistake.

Zorrito yawned, covering his mouth with a paw.

"Well, I suppose the simple things are always worth a try," said
Ophelia. She knocked; the doors were opened unto her.

-----

"This is, of course, /all your fault./"

"I love it!" said Ophelia.

"This is because you are a ridiculous, silly girl," said Zorrito.

"I will admit to that," said Ophelia.

The doors had opened into a long, open space, lined with columns and
arches. It was very much like a cathedral, except that a stream of
water flowed down the center, and the roof was too high to see, and
the chapels off to the side and the stained glass windows were a
little bit different.

"Well. Who is it?" asked Zorrito, resigned to an explanation.

"It's /Magical Slayer Mamika/," said Ophelia. "She's really cute, and
does this super cool ultimate /Magical Splash Flare/."

The fox examined the runes skeptically. "And she uses this...
/orbital bombardment/ ... to make friends."

Ophelia nodded. "Yep. It's a /classic/. Look! The heart on her wand is
sparkling."

The fox, slightly bored, wandered on to the next little nook, and set
about reading, while Ophelia marvelled at the glasswork.

Suddenly, there was a sputtering, choking noise. "What ... what,
in the name of all that is holy??" shouted Zorrito.

Ophelia ducked her head around the corner. "Oh! The Fire Sisters!"

"You /watched/ this?" he asked. "At /your/ age?"

"Oh. Laura made me skip one episode."

"You don't say," said the fox, glaring at the text beneath a window.

"Hey, Karen is cool. Honorary magical girl for sure, and she does
everything without magic. She's a real Ally of Justice with a song
about it and everything."

"Uh-huh," said the fox. "And that would be why the incense smells like
marshmallows, I suppose."

"Marshmallows /of justice/."

"I have my concerns," declared the fox.

-----

At the transept, where the long hall of the sanctuary crossed with a
short one, the stream of water branched off to the right, coursing
down a few steps. Above this, in place of a tabernacle, or an altar,
where the great cross might hang, there floated instead an image of a
lady in white, with golden eyes and pink hair. Her dress was short in
front, but long in the back, and on its inside shone the stars and the
cosmos.

Ophelia looked at the figure, askance.

"Your thoughts?" inquired the fox.

"I think ... I think I've seen her before, and this is spoilers."

"That'd be one word for it."

"Who is she?"

"Hope," said the fox.

Ophelia spent a few moments in contemplation, feeling a certain
gravity to the situation.

"I like this place," she said; "I like it a lot, but what is it all
here for?"

"For the vigil, of course."

"How's that, now?"

"It's traditional, for knights. Cleansing. Vigil. The white robe, to
symbolize purity."

"It's really more of a nightgown, though."

"Notwithstanding. That is the dream, correct? To be a knight?"

"Oh. Uh, not exactly?"

"A knight, in the service of Justice."

"Maybe?"

"Basically that."

"I don't like swords, though."

"No, of course not," said Zorrito, "you like /ballerinas/, which is
why you spent something like six hours watching the duck princess over
there." He glanced at a nearby nook.

"It was beautiful! It was /irresistible/. It was like someone cast a
magic spell and gave the show a real animation budget! I wish I could
move like that."

"Uh-huh. And how much did you watch?"

"Just ... the first season."

"And how many episodes was that, again?"

"Fine," said Ophelia. "/Five and a half/ hours."

"I was quite productive. Plotted an appropriate revenge. But Magical
Slayer Mamika got jealous. I heard her crying."

"Ha ha."

"So there's your vigil, at least. Are you on the adventure train or
are you off?"

"I'm ... going to consider the subject with the appropriate gravity."

"I'd settle for /some/ of the appropriate gravity. This is /justice/
we're talking about."

-----

Ophelia found Justice not far off the transept, overlooking a
reflecting pool at what seemed to be the end of the stream. It was a
classical rendition -- grey stone, blindfold, sword in the right hand,
balance in the left -- and quite tall, many times taller than the girl.

At the foot of the statue were two neatly folded garments.

"What's this?" asked Ophelia.

"Robes. You put them on."

"And take off my nightgown?"

"No. On top. The red one first, then pink."

"Why red first?"

"Well normally, you'd have a /black/ robe on the outside, as a symbol
of being willing to die for your feudal lord. It's not really
genre-appropriate here, though."

She donned the robes.

"Do you suppose," asked Zorro, "that you are truly ready to be a
faithful ally of justice?" asked Zorrito. "Do you know what this would
mean?"

"I'm ... not sure," admitted Ophelia.

"This path was not meant for you," said the fox. "Would you take it
anyway, commit to pay any price, without knowing what it may be, only
that it is right?"

"I think ... I think I can do that, yes," said the girl. "If it's
really, truly right."

"What do you suppose it takes to serve justice?" asked the fox. "Don't
answer that right away. Think on it a while."

She sat, thinking about it. A gentle ripple on the surface of the pool
caught her eye, and she turned to look at the pool.

A reflection looked back at her. It was not her own, but it might have
been her dream. A magical girl - a ballerina, perhaps - with bare
shoulders, red hair, tied back in an elegant bun, woven through with a
white ribbon, like icing on a cinnamon roll. But Ophelia's gaze was
drawn inexorably to the eyes: blue eyes, like her own, almost
comically big. Her expression was gentle, achingly beautiful, and yet
terrifying, for it felt to Ophelia as if her soul had been laid bare,
and it was very, very small.

She rose, slowly, so as not to break the gaze.

"I think," she said, "that to serve justice, one of the things you
need, one of the most important things, would have to be
understanding.  And that... that is something that I don't have a lot
of. I tell myself I know pretty well what's right and wrong, but there
are a lot of complicated things in the world where it's easy to lose
sight of that." She turned to look at Zorrito. "You might be right. I
might not be old enough, after all. Being an ally of justice is part
of my dream, but a lot of that is really just just a dream for me,
wanting to be cool. I'd probably do a terrible job. I don't think I'd
deserve it."

"Understanding is important," said the fox. "But understanding can be
grown, with experience. More important by far, and much harder to
teach or to grow, are the virtues of humility, and a pure heart, for
they will lead one to seek out that understanding which one does not
have." He paused, and turned to the statue. "I think she'll do fine."

The statue moved, sticking the tip of its sword in the ground, and,
with a right hand almost as tall as Ophelia herself, ever-so-gently
pushed the girl backwards into the pool.

-----

For a short eternity, in a space between worlds, Ophelia danced.

-----

*End Episode 1*
