html/01-summer-vacation.html

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Commercial Break</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<i>Author's note: I am unapologetic about this shift in style.</i>
<i>The previous section will be edited in due course</i>
<i>and will contain additional exposition.</i>
<i>In the meantime, please have these notes and this section.</i>
</p>

<p>
<i>The Yucatan peninsula is made of limestone.</i>
<i>Sometimes the ground gives way to reveal freshwater</i>
<i>pools that had been hidden underneath the surface.</i>
<i>Some are attached to vast underwater cave systems.</i>
<i>They were regarded as sacred, portals to the underworld.</i>
</p>

<p>
Ophelia, barefoot, in naught but a nightgown, carefully opened the
door and looked out at the night.
</p>

<p>
A few moments later, she carefully closed the door.
</p>

<p>
Another pause and she carefully opened the door, again, still
barefoot, but with a handbag. This would be important. The room key
was in the handbag, and there would be no tiptoeing past her brother
on the couch to get back in if she locked herself out.
</p>

<p>
In fact, the Goodwife No-Shoes was presently regretting her little
adventure. The cinnamony cocktail had been quite large, and she was
herself fairly small, and her stomach felt queasy. And the air in the
room was quite dry, from all the air conditioning. A walk outside in
the fresh air, then, seemed just the thing. Past the nook with the
rattling ice machine, down the stairs, over by the water fountain. A
pause, for a moment, to look at the full moon. The fountain bothered
her, though. The whole time-share bothered her, as a place. It was all
over-produced, trying to project the image of Luxury without bothering
to invest in the luxuries; all veneer and no substance, which was
somehow worse than not even trying.
</p>

<p>
The cenote was real enough, at least.
</p>

<p>
She soon found herself at the top of the stairs. The cenote &#x2013; more or
less a hole in the ground, with fresh water in the bottom &#x2013; wound
their way around the walls to a little platform at the bottom, with
stairs into the water.  The water would be cool and nice. Tempting.
She took a look at the to the stairs, closed - peligro!
</p>

<p>
Closed, but not locked. Ophelia considered a moment, pondering the
merits of continuing. A thought occurred to her.  She had made a
promise to her mother about going into the water&#x2026; and her little
bottle of holy water was right there, in her bag.
</p>

<p>
So she annointed herself with a few drops, made the Sign of the Cross,
and descended, being careful to hold the handrail extra-carefully, and
sat down on the edge of the platform. The water was still, like glass,
reflecting the moon. She poked at the surface of the water with her
toes, experimentally, thinking to send gentle ripples towards the
reflection.
</p>

<p>
But something unusual happened. The water was cool, as expected, but
its surface was somehow firm; it did not make way for her foot.  For a
moment she was confused: was there perhaps a rock just there under the
water? But no &#x2013; further probing showed the whole surface to be like
glass.
</p>

<p>
With a smile she stepped down onto the water, twirled about a few
times, and laughed. With cautious steps, she made her way across the
pool of water to the reflection of the moon. Then the surface of the
water glowed a pale blue, and the water surged around her like a
fountain, and the underworld took her.
</p>

<hr  />

<p>
A number of things happened next, but they flowed from one to another
in a dream-like way, so it was hard to put them all in a definite
order. Perhaps they all happened at once. Perhaps none of them
happened at all. It is hard to say.
</p>

<p>
In one moment, she was standing on a brightly lit stage, performing a
song with her choir at school. She had a solo, and looked out at the
audience, and saw instead a field of stars. In another moment, she was
wandering through the woods behind her house - which bled into a
third, as she continued along a path surrounded by tall weeds, past an
ill-kempt railway station to the little old ballet studio. In another,
it was fall, and she had climbed the dogwood tree in her backyard, and
looked out over a sea of red leaves.
</p>

<p>
In turn they all gave way to a conversation. It was a dark place, with
stone walls, lit by dim, flaring lamps. On one side was a wide
passageway, leading around a corner, and on the wall was a large
shadow with glowing eyes and a deep, deep voice.
</p>

<p>
"What in God's name are you doing here?" asked the voice, and Ophelia
caught a glimpse of what might have been pointy teeth.
</p>

<p>
"Oh," said Ophelia, still just a little disoriented, "I suppose I'm
looking for an adventure."
</p>

<p>
"An adventure," repeated the shadow, skeptically. "In the underworld."
</p>

<p>
"It was really just a spur-of-the-moment thing," explained Ophelia,
"a once in a lifetime opportunity. How could I refuse?"
</p>

<p>
The shadow paused for a moment, perhaps considering. "Be that as it may,
this way was not meant for you. It's not too late to turn back."
</p>

<p>
"Not meant for me? Why not?" asked Ophelia.
</p>

<p>
"It just <i>wasn't</i>. For starters, your age. You are either too young,
or else far too old."
</p>

<p>
"Yeah, well, that's basically middle school, isn't it?"
</p>

<p>
"Hmmph," said the voice, and it was quiet for a while.
</p>

<p>
"So anyway, what's your name?" asked Ophelia.
</p>

<p>
"I am&#x2026; <i>el zorro</i>," said the voice.
</p>

<p>
"Zorro?" said Ophelia. She immediately recalled trips to the library
with her father, renting classic black and white TV series on DVDs:
bandits, and horses, and a vigilante in a mask, ridiculously bad
swordplay&#x2026; an old theme song straight out of the fifties, three
slashes with a sword.
</p>

<p>
An insight occurred to the girl, and she was quite pleased with
herself.
</p>

<p>
"&#x2026; the <i>fox</i>, so cunning and free!"
</p>

<p>
"Mmm," grunted the shadow.
</p>

<p>
But Ophelia was not quite content to leave it at that. "It's a pretty
cool name, but it reminds me of hokey old television. Can I call
you Zorrito?"
</p>

<p>
"<i>What.</i>"
</p>

<p>
The voice had lost some of its depth.
</p>

<p>
"&#x2026; it's a diminutive?"
</p>

<p>
The shadow melted away from the wall, and from around the corner
strolled a rather ordinary-sized fox, with sandy fur. "You're in the
<i>underworld</i>, talking to a shadow easily twenty times your size, and
you decide to <i>name it</i> with a <i>diminutive?</i>" He gave an exasperated
sigh. "Tell me, what would you have done if I had just decided to eat
you right there?"
</p>

<p>
"Holy water?"
</p>

<p>
The small fox eyed Ophelia skeptically. "Fine. You're either a born
natural, or you're quite mad. Probably both. Proceed, then, on your
adventure."
</p>

<p>
"Oh. Did I just pass some sort of a test?"
</p>

<p>
"No," said the fox, "I'm here to warn off the unqualified, and <i>maybe</i>
occasionally even eat them. You're just lucky that I'm tame."
</p>

<p>
The girl furrowed her brow. "Eating people doesn't really seem very
tame."
</p>

<p>
"It's a different matter for different people, of course," explained
the fox. "In your case, you can probably thank your mother."
</p>

<p>
"Huh." She looked at the fox, quizzically.
</p>

<p>
"Well. Weren't you going on an adventure?"
</p>

<p>
"I suppose I was!"
</p>

<p>
"Well, I'm not here to tell you what to do, but it won't be much of an
adventure if you just lurk around in the first antechamber for all
eternity. Even if you're in love with antechambers, I assure you,
we have better ones."
</p>

<p>
"Right," said Ophelia, and set off down the corridor.
</p>

<hr  />

<p>
The path led out from behind a waterfall and across a pool as a series
of stepping-stones. The fall itself was tall and narrow, but the flow
was silky and smooth, like a dreamy long-exposure photo of falling
water, and when she passed through, it didn't feel wet, just
effervescent, and her nightgown remained dry.
</p>

<p>
She was in a narrow valley, and the sky above was lit like the surface
of the water, but with more colors. When the stepping stones ended,
she stepped out onto the water again, and walked across the
surface. Her braid had come undone in the waterfall, and her hair
trailed back behind her as she walked, as if she was underwater.
</p>

<p>
Zorrito, not far behind, sat down on the surface of the water, and
floated along behind. Soon, they arrived at a great edifice,
stretching across the valley, with grand doors that were probably
taller than her house, all inscribed with a language she didn't
understand.
</p>

<p>
"It's not very Aztec, is it?" asked Ophelia, taking stock of the place.
</p>

<p>
"Of course it isn't," said Zorro.
</p>

<p>
"Why not?"
</p>

<p>
"You yourself are of mixed Slavic and English heritage, and Christian
upbringing. You are staying in Mexico, yes, but at a cenote long
abandoned by the native population, in a hotel constructed by a
post-colonial, mestizo labor force, on behalf of a Delaware
corporation. But even aside from all this, even we were at Chichen
Itza itself during the heyday of the indigenous peoples of the Yucatan
peninsula, it would not have been Aztec" said the fox, pausing a
moment for special emphasis, "because they were <i>Mayans.</i>"
</p>

<p>
"Oh," said Ophelia, abashed. She looked up at the doors, a deep black,
lettering inlaid with silver. The door handles were well above her
head.
</p>

<p>
She puzzled about that for a bit, to distract herself from her
mistake.
</p>

<p>
Zorrito yawned, covering his mouth with a paw.
</p>

<p>
"Well, I suppose the simple things are always worth a try," said
Ophelia. She knocked; the doors were opened unto her.
</p>

<hr  />

<p>
"This is, of course, <i>all your fault.</i>"
</p>

<p>
"I love it!" said Ophelia.
</p>

<p>
"This is because you are a ridiculous, silly girl," said Zorrito.
</p>

<p>
"I will admit to that," said Ophelia.
</p>

<p>
The doors had opened into a long, open space, lined with columns and
arches. It was very much like a cathedral, except that a stream of
water flowed down the center, and the roof was too high to see, and
the chapels off to the side and the stained glass windows were a
little bit different.
</p>

<p>
"Well. Who is it?" asked Zorrito, resigned to an explanation.
</p>

<p>
"It's <i>Magical Slayer Mamika</i>," said Ophelia. "She's really cute, and
does this super cool ultimate <i>Magical Splash Flare</i>."
</p>

<p>
The fox examined the runes skeptically. "And she uses this&#x2026;
<i>orbital bombardment</i> &#x2026; to make friends."
</p>

<p>
Ophelia nodded. "Yep. It's a <i>classic</i>. Look! The heart on her wand is
sparkling."
</p>

<p>
The fox, slightly bored, wandered on to the next little nook, and set
about reading, while Ophelia marvelled at the glasswork.
</p>

<p>
Suddenly, there was a sputtering, choking noise. "What &#x2026; what,
in the name of all that is holy??" shouted Zorrito.
</p>

<p>
Ophelia ducked her head around the corner. "Oh! The Fire Sisters!"
</p>

<p>
"You <i>watched</i> this?" he asked. "At <i>your</i> age?"
</p>

<p>
"Oh. Laura made me skip one episode."
</p>

<p>
"You don't say," said the fox, glaring at the text beneath a window.
</p>

<p>
"Hey, Karen is cool. Honorary magical girl for sure, and she does
everything without magic. She's a real Ally of Justice with a song
about it and everything."
</p>

<p>
"Uh-huh," said the fox. "And that would be why the incense smells like
marshmallows, I suppose."
</p>

<p>
"Marshmallows <i>of justice</i>."
</p>

<p>
"I have my concerns," declared the fox.
</p>

<hr  />

<p>
At the transept, where the long hall of the sanctuary crossed with a
short one, the stream of water branched off to the right, coursing
down a few steps. Above this, in place of a tabernacle, or an altar,
where the great cross might hang, there floated instead an image of a
lady in white, with golden eyes and pink hair. Her dress was short in
front, but long in the back, and on its inside shone the stars and the
cosmos.
</p>

<p>
Ophelia looked at the figure, askance.
</p>

<p>
"Your thoughts?" inquired the fox.
</p>

<p>
"I think &#x2026; I think I've seen her before, and this is spoilers."
</p>

<p>
"That'd be one word for it."
</p>

<p>
"Who is she?"
</p>

<p>
"Hope," said the fox.
</p>

<p>
Ophelia spent a few moments in contemplation, feeling a certain
gravity to the situation.
</p>

<p>
"I like this place," she said; "I like it a lot, but what is it all
here for?"
</p>

<p>
"For the vigil, of course."
</p>

<p>
"How's that, now?"
</p>

<p>
"It's traditional, for knights. Cleansing. Vigil. The white robe, to
symbolize purity."
</p>

<p>
"It's really more of a nightgown, though."
</p>

<p>
"Notwithstanding. That is the dream, correct? To be a knight?"
</p>

<p>
"Oh. Uh, not exactly?"
</p>

<p>
"A knight, in the service of Justice."
</p>

<p>
"Maybe?"
</p>

<p>
"Basically that."
</p>

<p>
"I don't like swords, though."
</p>

<p>
"No, of course not," said Zorrito, "you like <i>ballerinas</i>, which is
why you spent something like six hours watching the duck princess over
there." He glanced at a nearby nook.
</p>

<p>
"It was beautiful! It was <i>irresistible</i>. It was like someone cast a
magic spell and gave the show a real animation budget! I wish I could
move like that."
</p>

<p>
"Uh-huh. And how much did you watch?"
</p>

<p>
"Just &#x2026; the first season."
</p>

<p>
"And how many episodes was that, again?"
</p>

<p>
"Fine," said Ophelia. "<i>Five and a half</i> hours."
</p>

<p>
"I was quite productive. Plotted an appropriate revenge. But Magical
Slayer Mamika got jealous. I heard her crying."
</p>

<p>
"Ha ha."
</p>

<p>
"So there's your vigil, at least. Are you on the adventure train or
are you off?"
</p>

<p>
"I'm &#x2026; going to consider the subject with the appropriate gravity."
</p>

<p>
"I'd settle for <i>some</i> of the appropriate gravity. This is <i>justice</i>
we're talking about."
</p>

<hr  />

<p>
Ophelia found Justice not far off the transept, overlooking a
reflecting pool at what seemed to be the end of the stream. It was a
classical rendition &#x2013; grey stone, blindfold, sword in the right hand,
balance in the left &#x2013; and quite tall, many times taller than the girl.
</p>

<p>
At the foot of the statue were two neatly folded garments.
</p>

<p>
"What's this?" asked Ophelia.
</p>

<p>
"Robes. You put them on."
</p>

<p>
"And take off my nightgown?"
</p>

<p>
"No. On top. The red one first, then pink."
</p>

<p>
"Why red first?"
</p>

<p>
"Well normally, you'd have a <i>black</i> robe on the outside, as a symbol
of being willing to die for your feudal lord. It's not really
genre-appropriate here, though."
</p>

<p>
She donned the robes.
</p>

<p>
"Do you suppose," asked Zorro, "that you are truly ready to be a
faithful ally of justice?" asked Zorrito. "Do you know what this would
mean?"
</p>

<p>
"I'm &#x2026; not sure," admitted Ophelia.
</p>

<p>
"This path was not meant for you," said the fox. "Would you take it
anyway, commit to pay any price, without knowing what it may be, only
that it is right?"
</p>

<p>
"I think &#x2026; I think I can do that, yes," said the girl. "If it's
really, truly right."
</p>

<p>
"What do you suppose it takes to serve justice?" asked the fox. "Don't
answer that right away. Think on it a while."
</p>

<p>
She sat, thinking about it. A gentle ripple on the surface of the pool
caught her eye, and she turned to look at the pool.
</p>

<p>
A reflection looked back at her. It was not her own, but it might have
been her dream. A magical girl - a ballerina, perhaps - with bare
shoulders, red hair, tied back in an elegant bun, woven through with a
white ribbon, like icing on a cinnamon roll. But Ophelia's gaze was
drawn inexorably to the eyes: blue eyes, like her own, almost
comically big. Her expression was gentle, achingly beautiful, and yet
terrifying, for it felt to Ophelia as if her soul had been laid bare,
and it was very, very small.
</p>

<p>
She rose, slowly, so as not to break the gaze.
</p>

<p>
"I think," she said, "that to serve justice, one of the things you
need, one of the most important things, would have to be
understanding.  And that&#x2026; that is something that I don't have a lot
of. I tell myself I know pretty well what's right and wrong, but there
are a lot of complicated things in the world where it's easy to lose
sight of that." She turned to look at Zorrito. "You might be right. I
might not be old enough, after all. Being an ally of justice is part
of my dream, but a lot of that is really just just a dream for me,
wanting to be cool. I'd probably do a terrible job. I don't think I'd
deserve it."
</p>

<p>
"Understanding is important," said the fox. "But understanding can be
grown, with experience. More important by far, and much harder to
teach or to grow, are the virtues of humility, and a pure heart, for
they will lead one to seek out that understanding which one does not
have." He paused, and turned to the statue. "I think she'll do fine."
</p>

<p>
The statue moved, sticking the tip of its sword in the ground, and,
with a right hand almost as tall as Ophelia herself, ever-so-gently
pushed the girl backwards into the pool.
</p>

<hr  />

<p>
For a short eternity, in a space between worlds, Ophelia danced.
</p>

<hr  />

<p>
<b>End Episode 1</b>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
